This is a data preprocessor for Immigration Enforcement Data Tables from https://www.dhs.gov/immigration-statistics/enforcement-actions

In [1]:
# General Utility# Gener 
import pandas as pd
import matplotlib.pyplot as plt
import seaborn as sns
import numpy as np
import copy
import warnings
from IPython.display import display
from IPython.display import Image
%matplotlib inline

In [24]:
df_33 = pd.read_excel('fy2016_table33.xls', header=3)
df_33.iloc[40:]

,Year,Number,Year.1,Number.1
40,1965,110371.0,2011,678606.0
41,1966,138520.0,2012,671327.0
42,1967,161608.0,2013,662483.0
43,1968,212057.0,2014,679996.0
44,1969,283557.0,2015,462388.0
45,1970,345353.0,2016 4,530250.0
46,"1 Includes the 15 months from July 1, 1975 to ...",NaN,NaN,NaN
47,"2 Beginning in 2008, includes all administrati...",NaN,NaN,NaN
48,"3 Beginning in 2009, data include administrati...",NaN,NaN,NaN
49,3 The counting methodology for administrative ...,NaN,NaN,NaN
50,Note: Data refer to Border Patrol apprehension...,NaN,NaN,NaN
51,Source: U.S. Department of Homeland Security.,NaN,NaN,NaN

The rows at the bottom (46 on) are notes in the excel file, and I don't want them. I could simply drop rows 46+, but if I use this script again with future data releases, I'd have to change that number and that limits reuse. Instead, I'll drop rows with NaN values.

In [25]:
df_33.dropna(inplace=True)
df_33.iloc[35:]

    Year    Number  Year.1   Number.1
35  1960   70684.0    2006  1206408.0
36  1961   88823.0    2007   960673.0
37  1962   92758.0  2008 2  1043759.0
38  1963   88712.0  2009 3   889212.0
39  1964   86597.0    2010   796587.0
40  1965  110371.0    2011   678606.0
41  1966  138520.0    2012   671327.0
42  1967  161608.0    2013   662483.0
43  1968  212057.0    2014   679996.0
44  1969  283557.0    2015   462388.0
45  1970  345353.0  2016 4   530250.0

Looking at the values for column Year.1, we see that some years have an extra number. In the Excel file, these are superscripts. We don't want to include those either. I'll start by looking at the types of the columns.

In [28]:
df_33.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 46 entries, 0 to 45
Data columns (total 4 columns):
Year        46 non-null object
Number      46 non-null float64
Year.1      46 non-null object
Number.1    46 non-null float64
dtypes: float64(2), object(2)
memory usage: 1.8+ KB

In [36]:
df_33.head(6)

   Year   Number  Year.1   Number.1
0  1925  22199.0    1971   420126.0
1  1926  12735.0    1972   505949.0
2  1927  16393.0    1973   655968.0
3  1928  23566.0    1974   788145.0
4  1929  32711.0    1975   766600.0
5  1930  20880.0  1976 1  1097739.0

In [55]:
print('For the value in row {}, column Year.1 of df_33, the type = {}'.format(2,type(df_33['Year.1'][2])))
print('For the value in row {}, column Year.1 of df_33, the type = {}'.format(5,type(df_33['Year.1'][5])))

For the value in row 2, column Year.1 of df_33, the type = <class 'int'>
For the value in row 5, column Year.1 of df_33, the type = <class 'str'>

Ok, so some of these values are ints, but the ones we need to clean up are Strings. I'll check both columns 'Year' and 'Year.1'.

In [58]:
display(df_33[[type(x) == str for x in df_33['Year']]])
display(df_33[[type(x) == str for x in df_33['Year.1']]])

Empty DataFrame
Columns: [Year, Number, Year.1, Number.1]
Index: []

    Year    Number  Year.1   Number.1
5   1930   20880.0  1976 1  1097739.0
37  1962   92758.0  2008 2  1043759.0
38  1963   88712.0  2009 3   889212.0
45  1970  345353.0  2016 4   530250.0

In [67]:
tmp = df_33[[type(x) == str for x in df_33['Year.1']]]
df_33.loc[[type(x) == str for x in df_33['Year.1']],['Year.1']] = [int(x.split()[0]) for x in tmp['Year.1']]

In [69]:
print('For the value in row {}, column Year.1 of df_33, the type = {}'.format(2,type(df_33['Year.1'][2])))
print('For the value in row {}, column Year.1 of df_33, the type = {}'.format(5,type(df_33['Year.1'][5])))

For the value in row 2, column Year.1 of df_33, the type = <class 'numpy.int64'>
For the value in row 5, column Year.1 of df_33, the type = <class 'numpy.int64'>

In [70]:
display(df_33[[type(x) == str for x in df_33['Year.1']]])

Empty DataFrame
Columns: [Year, Number, Year.1, Number.1]
Index: []

Now we see that there aren't any String values in column 'Year.1' and the values we checked before are no longer int and str, rather they're numpy.int64 now. Pandas automatically coerced them to a smaller and faster type when the added complexity was no longer needed.

In [48]:
# df_33['Year.1'][type(x) == str for x in df_33['Year.1']]
df_33[[type(x) == str for x in df_33['Year.1']]]

    Year    Number  Year.1   Number.1
5   1930   20880.0  1976 1  1097739.0
37  1962   92758.0  2008 2  1043759.0
38  1963   88712.0  2009 3   889212.0
45  1970  345353.0  2016 4   530250.0

In [82]:
df_33.head(2)

   Year   Number  Year.1  Number.1
0  1925  22199.0    1971  420126.0
1  1926  12735.0    1972  505949.0

Now I want to combine these year and number columns. To do this, I'll take the '_.1' columns, rename their columns (to match the other columns) and append() them together.

In [95]:
tmp = df_33.loc[:,['Year.1', 'Number.1']]
tmp.columns = ['Year', 'Number']
df_33 = df_33.loc[:,['Year', 'Number']].append(tmp, ignore_index=True)

In [96]:
df_33.shape

(92, 2)

Now I want to set the index to be the Year.

In [98]:
df_33.set_index('Year', inplace=True)

In [99]:
df_33.head(5)

       Number
Year
1925  22199.0
1926  12735.0
1927  16393.0
1928  23566.0
1929  32711.0

We're nearly done preprocessing this single table (of 9, the government isn't trying to make this easy), but as we're going to merge this with probably (at least) 8 other columns, I want to change 'Number' to something more meaningful.

In [110]:
df_33.rename(columns={'Number':'aliens_apprehended'}, inplace=True)

In [111]:
df_33.head(5)

      aliens_apprehended
Year
1925             22199.0
1926             12735.0
1927             16393.0
1928             23566.0
1929             32711.0